{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/ad3619ae-a0e9-11eb-89ea-029778b6f45f')]",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/ad3619ae-a0e9-11eb-89ea-029778b6f45f')]",
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "kind": "Scheduled",
      "apiVersion": "2023-02-01-preview",
      "properties": {
        "displayName": "Connection with suspicious User Agent (via office365) by SOC Prime Team",
        "description": "May be used for direct download via Powershell or other tools. Technique: T1105,T1105.",
        "alertDetailsOverride": null,
        "customDetails": null,
        "entityMappings": null,
        "eventGroupingSettings": null,
        "incidentConfiguration": {
          "createIncident": true,
          "groupingConfiguration": {
            "enabled": false,
            "groupByAlertDetails": null,
            "groupByCustomDetails": null,
            "groupByEntities": [],
            "lookbackDuration": "PT5M",
            "matchingMethod": "AllEntities",
            "reopenClosedIncident": false
          }
        },
        "query": "OfficeActivity | where (UserAgent contains \"Wget\" or UserAgent contains \"curl\" or UserAgent contains \"PowerShell\" or UserAgent contains \"WinRM\" or UserAgent contains \"Bits\")",
        "queryPeriod": "PT12H",
        "queryFrequency": "PT12H",
        "sentinelEntitiesMappings": null,
        "severity": "Medium",
        "suppressionDuration": "PT12H",
        "suppressionEnabled": true,
        "tactics": [
          "CommandAndControl",
          "LateralMovement"
        ],
        "techniques": null,
        "templateVersion": null,
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0,
        "alertRuleTemplateName": null,
        "enabled": true
      }
    }
  ]
}